<?php

return [
    'custom' => [
        'selected_courses' => [
            'level' => [
                'required' => 'يجب أن يكون لكل دورة مستوى تعليمي مرتبط بها',
                'exists' => 'المستوى التعليمي المحدد غير صالح.',
            ],
            'class' => [
                'required' => 'يجب أن يكون لكل دورة فصل دراسي محدد.',
                'exists' => 'الفصل الدراسي المحدد غير صالح.',
            ],
            'subject' => [
                'required' => 'يجب أن يكون لكل دورة مادة تعليمية محددة.',
                'exists' => 'المادة التعليمية المحدد غير صالح',
            ],
        ],
    ],
];